Revit 2027 API
FilterStringGreater Class
 Tests whether string values from the document would sort after a certain string.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterStringRuleEvaluator
 Autodesk.Revit.DB.FilterStringGreater
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterStringGreater : FilterStringRuleEvaluator
Public Class FilterStringGreater
	Inherits FilterStringRuleEvaluator
public ref class FilterStringGreater : public FilterStringRuleEvaluator
type FilterStringGreater =
    class
        inherit FilterStringRuleEvaluator
    end
The FilterStringGreater type exposes the following members.
Constructors
Name | Description
FilterStringGreater |  Constructs an instance of FilterStringGreater.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from FilterStringRuleEvaluator)
Top
Methods
Name | Description
Dispose
(Inherited from FilterStringRuleEvaluator)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Evaluate |  Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not.
(Inherited from FilterStringRuleEvaluator)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 All string comparisons in this class are performed in the case-insensitive manner.
See Also
Reference
Autodesk.Revit.DB Namespace